<h2>Panda</h2>

<h3>Import Libraries</h3>

In [2]:
import pandas as pd

<h3>Introduction to pandas Data structure</h3>
<h4>pandas has two main data structures it uses, namely, series and dataframes</h4>

<h3>Panda Series</h3>
<h4>pnadas series one-dimensional labeled array</h4>

In [1]:
#here 100,200,300,400 are vales and tom, bob are index
ser = pd.Series([100,200,300,400,500],['tom','bob','nancy','dan','eric'])

NameError: name 'pd' is not defined

In [3]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [4]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [5]:
ser.values

array([100, 200, 300, 400, 500])

In [6]:
ser['tom']

100

In [7]:
ser['tom':'nancy']

tom      100
bob      200
nancy    300
dtype: int64

In [10]:
ser[['tom','nancy','eric']]

tom      100
nancy    300
eric     500
dtype: int64

In [11]:
#retreiving from index values
print(ser[2])
print(ser[1:4])
print(ser[[1,3,4]])

300
bob      200
nancy    300
dan      400
dtype: int64
bob     200
dan     400
eric    500
dtype: int64

In [12]:
#lock is not method but it retries values present at indexes
#lock functions refers with only labels
#ilock used for integer positions
ser.loc[['bob','nancy']]

bob      200
nancy    300
dtype: int64

In [13]:
#ilock used for integer positions
ser.iloc[2:5]

nancy    300
dan      400
eric     500
dtype: int64

<h3>"In" or "not in" operators</h3>

In [14]:
'tom' in ser

True

In [15]:
'cat' not in ser

True

In [16]:
#empty panda series
s=pd.Series()
s

Series([], dtype: float64)

In [17]:
#any operation on panda series will be performed elemrnt wise
ser*2

tom       200
bob       400
nancy     600
dan       800
eric     1000
dtype: int64

In [18]:
ser[['bob','eric']]**2

bob      40000
eric    250000
dtype: int64

In [19]:
#will not replace orginal valies does operations on copy
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

<h3>Pandas DataFrame</h3>
<h4>Pandas DataFrame is a 2-D labeled data structure.</h4>

<h3>Create DataFram from dictionary of Python Series</h3>

In [3]:
d = {'one' : pd.Series([100.0,200.0,300.0], index=['apple','ball','clock']),
    'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}
d

{'one': apple    100.0
 ball     200.0
 clock    300.0
 dtype: float64, 'two': apple      111.0
 ball       222.0
 cerill     333.0
 dancy     4444.0
 dtype: float64}

In [4]:
# passing panda series as dataframes
df =pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [25]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [26]:
df.columns

Index(['one', 'two'], dtype='object')

In [27]:
df.values

array([[ 100.,  111.],
       [ 200.,  222.],
       [  nan,  333.],
       [ 300.,   nan],
       [  nan, 4444.]])

In [28]:
pd.DataFrame(d, index=['dancy','ball','apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [30]:
# as column is not present it will display the column with Nan's
pd.DataFrame(d, index=['dancy','ball','apple'], columns=['two','five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

In [31]:
pd.DataFrame(d, index=['dancy','ball','apple'], columns=['four','five'])

      four five
dancy  NaN  NaN
ball   NaN  NaN
apple  NaN  NaN

<font color="blue">
<h3>Create DataFrame from list of Python dictionaries</h3></font>

In [34]:
#keys will become columns 
data = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20},{'pica':5,'dum':10}]

In [35]:
#default indexing o and 1 as we didn't give any values
pd.DataFrame(data)

   alex  alice  dora   dum  ema  joe  pica
0   1.0    NaN   NaN   NaN  NaN  2.0   NaN
1   NaN   20.0  10.0   NaN  5.0  NaN   NaN
2   NaN    NaN   NaN  10.0  NaN  NaN   5.0

In [37]:
pd.DataFrame(data, index=['orange','red','blue'])

        alex  alice  dora   dum  ema  joe  pica
orange   1.0    NaN   NaN   NaN  NaN  2.0   NaN
red      NaN   20.0  10.0   NaN  5.0  NaN   NaN
blue     NaN    NaN   NaN  10.0  NaN  NaN   5.0

In [40]:
df = pd.DataFrame(data, columns=['joe','dora','alice'])
df

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0
2  NaN   NaN    NaN

<font color="blue">
<h3>Basic DataFrame operations</h3></font>

In [43]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [44]:
#single column extraction
#this is similar to series
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [46]:
df['three']= df['one'] + df['two']
df

          one     two  three
apple   100.0   111.0  211.0
ball    200.0   222.0  422.0
cerill    NaN   333.0    NaN
clock   300.0     NaN    NaN
dancy     NaN  4444.0    NaN

In [50]:
df['flag']=df['one']>250
df

          one     two  three   flag
apple   100.0   111.0  211.0  False
ball    200.0   222.0  422.0  False
cerill    NaN   333.0    NaN  False
clock   300.0     NaN    NaN   True
dancy     NaN  4444.0    NaN  False

In [51]:
three = df.pop('three')

In [52]:
three

apple     211.0
ball      422.0
cerill      NaN
clock       NaN
dancy       NaN
Name: three, dtype: float64

In [53]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [54]:
del df['flag']

In [55]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [57]:
df.insert(1,'new_col1',pd.Series([10,40,30], index=['apple','ball','cerill']))
df

          one  new_col1  mew_col1     two
apple   100.0      10.0      10.0   111.0
ball    200.0      40.0      40.0   222.0
cerill    NaN      30.0      30.0   333.0
clock   300.0       NaN       NaN     NaN
dancy     NaN       NaN       NaN  4444.0

In [59]:
df['one_upper_half'] = df['one'][:2]
df

          one  new_col1  mew_col1     two  one_upper_half
apple   100.0      10.0      10.0   111.0           100.0
ball    200.0      40.0      40.0   222.0           200.0
cerill    NaN      30.0      30.0   333.0             NaN
clock   300.0       NaN       NaN     NaN             NaN
dancy     NaN       NaN       NaN  4444.0             NaN

In [13]:
#dropna command drop the rows with NA's
df.dropna()

         one    two
apple  100.0  111.0
ball   200.0  222.0

In [14]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [16]:
#will replace main data frame value
df.dropna(inplace=True)

In [17]:
df

         one    two
apple  100.0  111.0
ball   200.0  222.0

In [20]:
df.fillna(500,inplace=False)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill  500.0   333.0
clock   300.0   500.0
dancy   500.0  4444.0

In [21]:
df.fillna(df['one'].mean(),inplace=False)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill  200.0   333.0
clock   300.0   200.0
dancy   200.0  4444.0

In [22]:
df.fillna(df.mean(),inplace=False)

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill  200.0   333.0
clock   300.0  1277.5
dancy   200.0  4444.0